laszloh/heystack-nrf5x/lis2dh12_reg.h
typedef enum
{
  LIS2DH12_DISC_FROM_INT_GENERATOR  = 0,
  LIS2DH12_ON_INT1_GEN              = 1,
  LIS2DH12_ON_INT2_GEN              = 2,
  LIS2DH12_ON_TAP_GEN               = 4,
  LIS2DH12_ON_INT1_INT2_GEN         = 3,
  LIS2DH12_ON_INT1_TAP_GEN          = 5,
  LIS2DH12_ON_INT2_TAP_GEN          = 6,
  LIS2DH12_ON_INT1_INT2_TAP_GEN     = 7,
} lis2dh12_hp_t;
int32_t lis2dh12_high_pass_int_conf_set(const stmdev_ctx_t *ctx,
                                        lis2dh12_hp_t val);
int32_t lis2dh12_high_pass_int_conf_get(const stmdev_ctx_t *ctx,
                                        lis2dh12_hp_t *val);

int32_t lis2dh12_pin_int1_config_set(const stmdev_ctx_t *ctx,
                                     lis2dh12_ctrl_reg3_t *val);
int32_t lis2dh12_pin_int1_config_get(const stmdev_ctx_t *ctx,
                                     lis2dh12_ctrl_reg3_t *val);

int32_t lis2dh12_int2_pin_detect_4d_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lis2dh12_int2_pin_detect_4d_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum
{
  LIS2DH12_INT2_PULSED   = 0,
  LIS2DH12_INT2_LATCHED  = 1,
} lis2dh12_lir_int2_t;
int32_t lis2dh12_int2_pin_notification_mode_set(const stmdev_ctx_t *ctx,
                                                lis2dh12_lir_int2_t val);
int32_t lis2dh12_int2_pin_notification_mode_get(const stmdev_ctx_t *ctx,
                                                lis2dh12_lir_int2_t *val);

int32_t lis2dh12_int1_pin_detect_4d_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lis2dh12_int1_pin_detect_4d_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum
{
  LIS2DH12_INT1_PULSED   = 0,
  LIS2DH12_INT1_LATCHED  = 1,
} lis2dh12_lir_int1_t;
int32_t lis2dh12_int1_pin_notification_mode_set(const stmdev_ctx_t *ctx,
                                                lis2dh12_lir_int1_t val);
int32_t lis2dh12_int1_pin_notification_mode_get(const stmdev_ctx_t *ctx,
                                                lis2dh12_lir_int1_t *val);

int32_t lis2dh12_pin_int2_config_set(const stmdev_ctx_t *ctx,
                                     lis2dh12_ctrl_reg6_t *val);
int32_t lis2dh12_pin_int2_config_get(const stmdev_ctx_t *ctx,
                                     lis2dh12_ctrl_reg6_t *val);

int32_t lis2dh12_fifo_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dh12_fifo_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_fifo_watermark_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dh12_fifo_watermark_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS2DH12_INT1_GEN = 0,
  LIS2DH12_INT2_GEN = 1,
} lis2dh12_tr_t;
int32_t lis2dh12_fifo_trigger_event_set(const stmdev_ctx_t *ctx,
                                        lis2dh12_tr_t val);
int32_t lis2dh12_fifo_trigger_event_get(const stmdev_ctx_t *ctx,
                                        lis2dh12_tr_t *val);

typedef enum
{
  LIS2DH12_BYPASS_MODE           = 0,
  LIS2DH12_FIFO_MODE             = 1,
  LIS2DH12_DYNAMIC_STREAM_MODE   = 2,
  LIS2DH12_STREAM_TO_FIFO_MODE   = 3,
} lis2dh12_fm_t;
int32_t lis2dh12_fifo_mode_set(const stmdev_ctx_t *ctx, lis2dh12_fm_t val);
int32_t lis2dh12_fifo_mode_get(const stmdev_ctx_t *ctx, lis2dh12_fm_t *val);

int32_t lis2dh12_fifo_status_get(const stmdev_ctx_t *ctx,
                                 lis2dh12_fifo_src_reg_t *val);

int32_t lis2dh12_fifo_data_level_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_fifo_empty_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_fifo_ovr_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_fifo_fth_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_tap_conf_set(const stmdev_ctx_t *ctx,
                              lis2dh12_click_cfg_t *val);
int32_t lis2dh12_tap_conf_get(const stmdev_ctx_t *ctx,
                              lis2dh12_click_cfg_t *val);

int32_t lis2dh12_tap_source_get(const stmdev_ctx_t *ctx,
                                lis2dh12_click_src_t *val);

int32_t lis2dh12_tap_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dh12_tap_threshold_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS2DH12_TAP_PULSED   = 0,
  LIS2DH12_TAP_LATCHED  = 1,
} lis2dh12_lir_click_t;
int32_t lis2dh12_tap_notification_mode_set(const stmdev_ctx_t *ctx,
                                           lis2dh12_lir_click_t val);
int32_t lis2dh12_tap_notification_mode_get(const stmdev_ctx_t *ctx,
                                           lis2dh12_lir_click_t *val);

int32_t lis2dh12_shock_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dh12_shock_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_quiet_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dh12_quiet_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_double_tap_timeout_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lis2dh12_double_tap_timeout_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lis2dh12_act_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dh12_act_threshold_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lis2dh12_act_timeout_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lis2dh12_act_timeout_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LIS2DH12_PULL_UP_CONNECT     = 0,
  LIS2DH12_PULL_UP_DISCONNECT  = 1,
} lis2dh12_sdo_pu_disc_t;
int32_t lis2dh12_pin_sdo_sa0_mode_set(const stmdev_ctx_t *ctx,
                                      lis2dh12_sdo_pu_disc_t val);
int32_t lis2dh12_pin_sdo_sa0_mode_get(const stmdev_ctx_t *ctx,
                                      lis2dh12_sdo_pu_disc_t *val);

typedef enum
{
  LIS2DH12_SPI_4_WIRE = 0,
  LIS2DH12_SPI_3_WIRE = 1,
} lis2dh12_sim_t;
int32_t lis2dh12_spi_mode_set(const stmdev_ctx_t *ctx, lis2dh12_sim_t val);
int32_t lis2dh12_spi_mode_get(const stmdev_ctx_t *ctx, lis2dh12_sim_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LIS2DH12_REGS_H */